In [1]:
# Series: A 1-D array
# Data Frame: A 2-D array
# Panel: A 3-D array

In [2]:
import pandas as pd
import numpy as np
pd.__version__               #Version
#pd.show_versions()          # for complete details

'2.0.2'

In [5]:
data = np.array(['a','b','c','d'])
ss = pd.Series(data,index=[100,101,102,103])

#with dictionary
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)

s.array # #To get actual data we can use this .array also

<PandasArray>
[0.0, 1.0, 2.0]
Length: 3, dtype: float64

In [4]:
#Data frame using Dictionary
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])

# from list
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],index=[1,2,3])

#Create a DataFrame from Dict of Series
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

#With index
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])

In [5]:
# pd.read_csv(filename) | From a CSV file
# DataFrame.to_csv

# pd.read_excel(filename) | From an Excel file
# DataFrame.to_excel

# pd.read_table(filename) | From a delimited text file (like TSV)
# pd.read_sql(query, connection_object) | Read from a SQL table/database

# pd.read_json(json_string) | Read from a JSON formatted string, URL or file.
# json_normalize
# DataFrame.to_json

# pd.read_html(url) | Parses an html URL, string or file and extracts tables to a list of dataframes
# DataFrame.to_html

# pd.read_clipboard() | Takes the contents of your clipboard and passes it to read_table()

# pd.DataFrame(dict) | From a dict, keys for columns names, values for data as lists

# read_pickle
# DataFrame.to_pickle

# read_xml
# DataFrame.to_xml

# read_parquet
# DataFrame.to_parquet

In [6]:
df4 = pd.read_excel('A_data.xls',sheet_name='D3',dtype={'Country': str, 'Unit Cost': float})

#sheet_name=[0,'ORDER'] more than one sheet reading with index or name
#engine ='xlrd' or 'openpyxl' or 'odf' or 'pyxlsb' --- if it is in xlsb format file so we need to use its related engine.
#dtype--Data type for data or columns.Column types are inferred but can be explicitly specified

In [7]:
df.head()
# type(df.Country)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [3]:
df11 = pd.read_excel('A_data.xls',sheet_name='D3',skiprows=2,skipfooter=3,usecols='A:B, D:E',header=3,index_col=1)
#skiprows---skip the number of n rows from the top
#skipfooter---skip n rows from the end
#usecols----from excel read what are the columns required-[0, 1, 2] or ['foo', 'bar', 'baz']
#header-----to avoid first 3 rows because header data is present at after 3 if there is no header pass as None
#index_col ---if index_col is 0,"1" is the index of the 1st column, "2" is index for the 2nd col so on. Default None.
df11

        01290-367248  524.96  Unnamed: 4
2974.0  01545-817375  159.42         NaN
4187.0  01362-620532  502.54         NaN
8082.0  01590-982428   90.93         NaN
6070.0           NaN   56.67         NaN
6593.0  01933-512513  117.11        good
124.0   01687-879391   90.93         NaN
4168.0  01517-624517     NaN         NaN
8263.0  01642-322954   35.84         NaN
8974.0  01342-793603  502.54  [1,2,3,55]
4901.0           NaN   56.67         NaN
1673.0  01672-496478   35.84         NaN
6952.0  01666-638176  263.33         NaN
5430.0  01241-964675   31.79         NaN
NaN     01207-428520  502.54     (8,6,5)
5908.0  01939-815208  364.69         NaN
7450.0  01859-648598  159.42         NaN
1273.0           NaN  159.42         NaN
2225.0  01583-287367   97.44         bad
2187.0  01280-786847    6.92         NaN
5070.0  01848-116775   56.67         NaN
1815.0  01604-718601  263.33         NaN
5398.0  01509-121140    6.92         NaN
5822.0  01315-284286    6.92         NaN
5124.0  01926-108010   31.79   {1:1,2:2}
2370.0  01307-667811  502.54         NaN
8661.0  01292-297245  263.33         NaN
2125.0  01366-210656   56.67         NaN
2924.0  01421-132652  524.96         NaN
8250.0  01405-648623  502.54         NaN
7327.0  01809-443217   97.44         NaN
6409.0  01351-868965   56.67         NaN

In [4]:
df12 = pd.read_excel('A_data.xls',sheet_name='D4',na_values=['n.a','not available'])
df12
# in place of n.a,not available replaces with NaN

  tickers    eps  revenue   price  people
0     nhk  21.50     87.0   845.0   larry
1    good   4.61    484.0    65.0     NaN
2      mt  -1.00     85.5    64.0    bill
3    msft    NaN     50.5  1023.0  mukesh
4     eil  54.00     -1.0     NaN    tata
5    tata   5.50     63.0    85.0    modi

In [10]:
df12 = pd.read_excel('A_data.xls',sheet_name='D4',na_values={'eps':['n.a','not available'],
                                                             'revenue':['n.a','not available',-1],
                     'price':['n.a','not available'],
                     'people':['n.a','not available']}
                     )
df12
#in revenue partivcular column we add -1 to change remaining to same.

  tickers    eps  revenue   price  people
0     nhk  21.50     87.0   845.0   larry
1    good   4.61    484.0    65.0     NaN
2      mt  -1.00     85.5    64.0    bill
3    msft    NaN     50.5  1023.0  mukesh
4     eil  54.00      NaN     NaN    tata
5    tata   5.50     63.0    85.0    modi

In [2]:
df= pd.read_excel('A_data.xls',sheet_name='D3',names=['phone','Units','Country','Units Cost','DataStructure'],nrows=12,mangle_dupe_cols='X',comment='##')
#names:List of column names to use. If file contains no header row, then you should explicitly pass header=None
#usecols :Return a subset of the columns. Results > in much faster parsing time and lower memory usage.
#nrows: no. of rows to retreive from data
#Comment lines in the excel input file can be skipped using the comment kwarg
#mangle_dupe_cols--specified as ‘X.1’. Passing in False will cause data to be overwritten if there are duplicate names in the columns.

NameError: name 'pd' is not defined

In [12]:
df111 = pd.read_csv('a.tsv',sep='/t')

C:\Users\nakka\anaconda3\lib\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

In [13]:
#Viewing/Inspecting Data

In [14]:
d = {'dbid': ['101', '102', '103', '107', '108', '109'],

'siteid': ['105', '104', '103', '1070', '1080', '1090'],

'country': ['c1', 'c2', 'c3', 'c4', 'c5', 'c6'],
'record':[1, 1, 1, 4, 5, 6],
'pop': [1000, 1000, 3000, 4000, 5000, 6000],
'phase':['p3', 'p2', 'p1', 'p1', 'p2', 'p2']}
df = pd.DataFrame(d)

In [15]:
df

  dbid siteid country  record   pop phase
0  101    105      c1       1  1000    p3
1  102    104      c2       1  1000    p2
2  103    103      c3       1  3000    p1
3  107   1070      c4       4  4000    p1
4  108   1080      c5       5  5000    p2
5  109   1090      c6       6  6000    p2

In [16]:
df[['country','pop']]

  country   pop
0      c1  1000
1      c2  1000
2      c3  3000
3      c4  4000
4      c5  5000
5      c6  6000

In [17]:
df.head()# first 5 rows
df.head(2)

  dbid siteid country  record   pop phase
0  101    105      c1       1  1000    p3
1  102    104      c2       1  1000    p2

In [18]:
df.tail()
df.tail(2)

  dbid siteid country  record   pop phase
4  108   1080      c5       5  5000    p2
5  109   1090      c6       6  6000    p2

In [19]:
df.get('record')
df.record
df['record']

0    1000
1    1000
2    3000
3    4000
4    5000
5    6000
Name: pop, dtype: int64

In [20]:
df[2:5] #rows

  dbid siteid country  record   pop phase
2  103    103      c3       1  3000    p1
3  107   1070      c4       4  4000    p1
4  108   1080      c5       5  5000    p2

In [21]:
df.columns
df.columns[0:3]

Index(['dbid', 'siteid', 'country'], dtype='object')

In [22]:
df.keys()

Index(['dbid', 'siteid', 'country', 'record', 'pop', 'phase'], dtype='object')

In [3]:
df.values #in array numpy values. according to rows mentioned its values print
df.values[0]

NameError: name 'df' is not defined

In [24]:
list(df.items())

[('dbid',
  0    101
  1    102
  2    103
  3    107
  4    108
  5    109
  Name: dbid, dtype: object),
 ('siteid',
  0     105
  1     104
  2     103
  3    1070
  4    1080
  5    1090
  Name: siteid, dtype: object),
 ('country',
  0    c1
  1    c2
  2    c3
  3    c4
  4    c5
  5    c6
  Name: country, dtype: object),
 ('record',
  0    1
  1    1
  2    1
  3    4
  4    5
  5    6
  Name: record, dtype: int64),
 ('pop',
  0    1000
  1    1000
  2    3000
  3    4000
  4    5000
  5    6000
  Name: pop, dtype: int64),
 ('phase',
  0    p3
  1    p2
  2    p1
  3    p1
  4    p2
  5    p2
  Name: phase, dtype: object)]

In [25]:
df.index  #row labals
len(df.index)
df.index.values

array([0, 1, 2, 3, 4, 5], dtype=int64)

In [26]:
index=[1,2,3,4,5,6]
df=df.reindex(index) #for adding index
df

  dbid siteid country  record     pop phase
1  102    104      c2     1.0  1000.0    p2
2  103    103      c3     1.0  3000.0    p1
3  107   1070      c4     4.0  4000.0    p1
4  108   1080      c5     5.0  5000.0    p2
5  109   1090      c6     6.0  6000.0    p2
6  NaN    NaN     NaN     NaN     NaN   NaN

In [4]:
df.set_value(2,3,1000) # setting value at row2 column 3 and value 1000

NameError: name 'df' is not defined

In [27]:
df.index[df['pop']==1000].tolist()

[1]

In [28]:
df.set_index("dbid") # we are choosing particular column and making that to index

     siteid country  record     pop phase
dbid
102     104      c2     1.0  1000.0    p2
103     103      c3     1.0  3000.0    p1
107    1070      c4     4.0  4000.0    p1
108    1080      c5     5.0  5000.0    p2
109    1090      c6     6.0  6000.0    p2
NaN     NaN     NaN     NaN     NaN   NaN

In [29]:
df.reset_index()   # the previous set index will be gone. anthoer index added

   index dbid siteid country  record     pop phase
0      1  102    104      c2     1.0  1000.0    p2
1      2  103    103      c3     1.0  3000.0    p1
2      3  107   1070      c4     4.0  4000.0    p1
3      4  108   1080      c5     5.0  5000.0    p2
4      5  109   1090      c6     6.0  6000.0    p2
5      6  NaN    NaN     NaN     NaN     NaN   NaN

In [30]:
df0 = pd.DataFrame([1, 2, 3, 4, 5],index=[100, 29, 234, 1, 150],columns=['A'])
df0.sort_index()    # we have provided random index so we can sort that.
df0.sort_index(ascending=False)

     A
234  3
150  5
100  1
29   2
1    4

In [31]:
#size of data
df.size    #no.rows*no.cols

36

In [32]:
print(df.shape[0])#no. rows
print(df.shape[1])# no .colums
df.shape

6
6

(6, 6)

In [33]:
df.ndim  #array dimensions.

2

In [34]:
#datatypes of data columns
df.dtypes

dbid        object
siteid      object
country     object
record     float64
pop        float64
phase       object
dtype: object

In [35]:
df.select_dtypes(include=['object'],exclude=['float64']) #only printed object columns

  dbid siteid country phase
1  102    104      c2    p2
2  103    103      c3    p1
3  107   1070      c4    p1
4  108   1080      c5    p2
5  109   1090      c6    p2
6  NaN    NaN     NaN   NaN

In [36]:
p=df.convert_dtypes() #Convert columns to best possible dtypes using dtypes supporting pd.NA.
df.dtypes, p.dtypes

(dbid        object
 siteid      object
 country     object
 record     float64
 pop        float64
 phase       object
 dtype: object,
 dbid       string
 siteid     string
 country    string
 record      Int64
 pop         Int64
 phase      string
 dtype: object)

In [37]:
dd = {'col1': [1, 2], 'col2': [3, 4]}
df5 = pd.DataFrame(data=dd)

df5.astype('int32').dtypes # casting int64 to int32
df5.astype({'col1': 'int32'}).dtypes # cast using dictionary

col1    int32
col2    int64
dtype: object

In [38]:
print(df.info)# concise summary of a DataFrame 
df.info(null_counts=True)

<bound method DataFrame.info of   dbid siteid country  record     pop phase
1  102    104      c2     1.0  1000.0    p2
2  103    103      c3     1.0  3000.0    p1
3  107   1070      c4     4.0  4000.0    p1
4  108   1080      c5     5.0  5000.0    p2
5  109   1090      c6     6.0  6000.0    p2
6  NaN    NaN     NaN     NaN     NaN   NaN>
<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 1 to 6
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   dbid     5 non-null      object
 1   siteid   5 non-null      object
 2   country  5 non-null      object
 3   record   5 non-null      float64
 4   pop      5 non-null      float64
 5   phase    5 non-null      object
dtypes: float64(2), object(4)
memory usage: 336.0+ bytes

C:\Users\nakka\AppData\Local\Temp/ipykernel_11016/235757753.py:2: FutureWarning: null_counts is deprecated. Use show_counts instead
  df.info(null_counts=True)

In [1]:
df.empty #Indicates whether Series/DataFrame is empty or not.
df['pop'][0].item()
df['pop'].any()
df['pop'].all()

NameError: name 'df' is not defined

In [ ]:
df.attrs #Dictionary of global attributes of this dataset.

In [ ]:
df.flags #Get the properties associated with this pandas object.
df2 = df.set_flags(allows_duplicate_labels=False)
df2

In [ ]:
pp=df.copy(deep=True)
pp

In [ ]:
#Selection

In [ ]:
df.get('country')[3] # we can also retrive with get of single value

In [5]:
print(df[['dbid','country']])
print(df.loc[1:3,'country'])
print(df.at[2, 'country'])
print(df.loc[2].at['country'])

NameError: name 'df' is not defined

In [ ]:
print(df.iloc[1:3,1:3])
print(df.iloc[[0,2],[1,3]])
print(df.iat[1, 2])
print(df.loc[0].iat[1])

In [ ]:
print(df[df.columns[~df.columns.isin(['phone','Country'])]])
print(df.loc[:,(df.dtypes=='float64').values])
print(df.loc[:,['o' in i for i in df.columns]])
print(df.loc[:,df.columns.str.startswith('p')])
df[df.columns[df.columns.isin(['phone','pop','NON-EXISTANT COLUMN'])]]

In [ ]:
df['rate']=[1,2,4,5,6,7]  # adding column 
df

In [ ]:
df.insert(1, "newco", [1,2,4,5,6,7]) # adding at specified location
df

In [ ]:
#for deleting column
df.pop('newco')
# del df['class']
# df.drop('class') #df.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False) #droping rows or cols
df

In [ ]:
a = {'dbid':110, 'siteid':120 , 'country': 'c7','record':8,'pop':7000,'phase':'rd','rate':8}
df= df.append(a, ignore_index = True)
df   # added at last

In [ ]:
df.memory_usage(index=True, deep=False)# memory usage of each column in bytes. include index true. 
# data deeply by interrogating object dtypes for system-level memory consumption

In [ ]:
df.rename(columns={"phase": "newcoldadd"})
#rename(mapper=None, *, index=None, columns=None, axis=None, copy=True, inplace=False, level=None, errors='ignore')

In [ ]:
df4 = pd.DataFrame({"num_legs": [4, 4, 2],
                   "num_arms": [0, 0, 2]},
                  ["dog", "cat", "monkey"])
df5 = df4.rename_axis("animal")
df5

In [6]:
#DataFrame.set_axis(labels, axis=0, inplace=False)
df00 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df00.set_axis(['I', 'II'], axis='columns')

   I  II
0  1   4
1  2   5
2  3   6

In [ ]:
df['record'].unique()

In [ ]:
df.nunique()  # it gives count of unique

In [ ]:
df.sort_values(by=['country'],ascending=True)

In [ ]:
s = pd.Series([3, 1, 2, 3, 4, np.nan])
s.value_counts()   #frequency
#df.value_counts(subset=None, normalize=False, sort=True, ascending=False, dropna=True)#counts of unique rows in the DataFrame.

In [ ]:
#transpose

df.transpose
df.T

In [ ]:
df.count() #Count non-NA cells for each column or row.

In [7]:
dic = {'First Score':[100, 90, np.nan, 95],'Second Score': [30, 45, 56, np.nan],'Third Score':[np.nan, 40, 80, 98]}
n = pd.DataFrame(dic)
print(n.where(n > 50)) #if then shows the values only the condition satisfied remaining shows as NaN

   First Score  Second Score  Third Score
0        100.0           NaN          NaN
1         90.0           NaN          NaN
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [8]:
n.mask(n > 80, 10) # replaces the values where n >80

   First Score  Second Score  Third Score
0         10.0          30.0          NaN
1         10.0          45.0         40.0
2          NaN          56.0         80.0
3         10.0           NaN         10.0

In [9]:
n.query('First Score > Second Score')

SyntaxError: invalid syntax (<unknown>, line 1)

In [10]:
n.describe()  # it prints statstics

       First Score  Second Score  Third Score
count          3.0      3.000000     3.000000
mean          95.0     43.666667    72.666667
std            5.0     13.051181    29.687259
min           90.0     30.000000    40.000000
25%           92.5     37.500000    60.000000
50%           95.0     45.000000    80.000000
75%           97.5     50.500000    89.000000
max          100.0     56.000000    98.000000

In [11]:
df.isin([0,2,6]) # each element in the DataFrame is contained in value

NameError: name 'df' is not defined

In [ ]:
first_valid_index() function-- Finding the first non-empty index in a series

covid_df.sample(10)
covid_df.sort_values('new_deaths', ascending=False).head(10)

In [ ]:
df3 = df1.append(df2)

After appending, DataFrame is:  same column names
  x y z
0 5 4 9
1 2 7 3
2 1 1 29
3 3 9 30

After appending, DataFrame is: #if differrent colun=mn names
  x   y    z   a   b   c
0 5.0 4.0 9.0 NaN NaN NaN
1 2.0 7.0 3.0 NaN NaN NaN
0 NaN NaN NaN 1.0 1.0 29.0
1 NaN NaN NaN 3.0 9.0 30.0

In [14]:
import pandas as pd
left = pd.DataFrame({
         'id':[1,2,3,4,5,6],
         'Name': ['Alex', 'Amy', 'Allen', 'Krishna','Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5','sub7']})
right = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
left

   id     Name subject_id
0   1     Alex       sub1
1   2      Amy       sub2
2   3    Allen       sub4
3   4  Krishna       sub6
4   5    Alice       sub5
5   6   Ayoung       sub7

In [15]:
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [16]:
pd.merge(left, right, on='subject_id', how='left')

   id_x   Name_x subject_id  id_y Name_y
0     1     Alex       sub1   NaN    NaN
1     2      Amy       sub2   1.0  Billy
2     3    Allen       sub4   2.0  Brian
3     4  Krishna       sub6   4.0  Bryce
4     5    Alice       sub5   5.0  Betty
5     6   Ayoung       sub7   NaN    NaN

In [17]:
pd.merge(right,left, on='subject_id', how='right')

   id_x Name_x subject_id  id_y   Name_y
0   NaN    NaN       sub1     1     Alex
1   1.0  Billy       sub2     2      Amy
2   2.0  Brian       sub4     3    Allen
3   4.0  Bryce       sub6     4  Krishna
4   5.0  Betty       sub5     5    Alice
5   NaN    NaN       sub7     6   Ayoung

In [22]:
pd.merge(left, right, on='subject_id', how='outer',suffixes=['_lr','_kr'])

   id_lr  Name_lr subject_id  id_kr Name_kr
0    1.0     Alex       sub1    NaN     NaN
1    2.0      Amy       sub2    1.0   Billy
2    3.0    Allen       sub4    2.0   Brian
3    4.0  Krishna       sub6    4.0   Bryce
4    5.0    Alice       sub5    5.0   Betty
5    6.0   Ayoung       sub7    NaN     NaN
6    NaN      NaN       sub3    3.0    Bran

In [ ]:
join() is used to combine two DataFrames on the index but not on columns whereas
merge() is primarily used to specify the columns you wanted to join on, this also supports joining on indexes and combination of index and columns.